Tekla.Structures.Internal.PluginHelper.GetAssemblyLocation(System.String)
Retrieves the full path to the specified AssemblyName.
Only searches in plugin directory folder.
AssemblyName: The file name without the extension.
Returns: The full path of the Assembly if found, otherwise empty string is returned. In the case the same assembly is found in multiple sub directories they are all returned separated by ";".